app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "ESef9HLnQzuD62vXitD9gQ"], ["long_url", "google.com"], ["user_id", 1], ["created_at", "2020-03-18 19:13:16.705622"], ["updated_at", "2020-03-18 19:13:16.705622"]]
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "-thKM4WUGman1ebyrNISVA"], ["long_url", "google.com"], ["user_id", 1], ["created_at", "2020-03-26 21:21:13.875368"], ["updated_at", "2020-03-26 21:21:13.875368"]]
---
    def self.create_shortened_url(user, long_url)
        short_code = ShortenedUrl.random_code
        short_url = ShortenedUrl.create!(
            short_url: "#{short_code}",
            long_url: "#{long_url}",
            user_id: user.id
        )

SELECT COUNT("shortened_urls"."user_id") FROM "shortened_urls" WHERE (created_at > '2020-03-26 21:20:13.868624')
---
    def no_spamming
        count = ShortenedUrl.where("created_at > ?", 1.minute.ago).count(:user_id)

SELECT COUNT("shortened_urls"."user_id") FROM "shortened_urls"
---
    def non_premium_max
        if submitter.premium == false
            count = ShortenedUrl.count(:user_id)

SELECT "shortened_urls".* FROM "shortened_urls" INNER JOIN "users" ON "users"."id" = "shortened_urls"."user_id" LEFT OUTER JOIN "visits" ON "visits"."shortened_url_id" = "shortened_urls"."id" WHERE ((users.premium = false) AND (visits.created_at < '2020-03-27 16:00:35.802362') OR (shortened_urls.created_at < '2020-03-27 16:00:35.844410') AND (visits.id IS NULL))
DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 9]]
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 69]]
---
    def self.prune(n)
        old_visits = ShortenedUrl.joins(:submitter).where("users.premium = false").left_outer_joins(:visits).where("visits.created_at < ?", 1.minutes.ago).or(
            ShortenedUrl.joins(:submitter).left_outer_joins(:visits).where("shortened_urls.created_at < ?", 1.minutes.ago).where("visits.id IS NULL"))
        old_visits.destroy_all