app/models/visit.rb

    def self.record_visit!(user, shortened_url)
        Visit.create!(user_id: user.id, shortened_url_id: shortened_url.id)
---
INSERT INTO "visits" ("created_at", "updated_at", "user_id", "shortened_url_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2020-03-17 19:46:54.957196"], ["updated_at", "2020-03-17 19:46:54.957196"], ["user_id", 1], ["shortened_url_id", "3"]]